Repository: QUIQQER/QSetup
Catalog: src/QUI/Setup/Locale/*/LC_MESSAGES/setupmessages.po
Languages: de

# setup.web.system.check.header
source: System check failed
de: System-Check fehlgeschlagen

# setup.web.system.check.header.desc
source: The server settings do not meet the minimum requirements of QUIQQER
de: Die Server Einstellungen entsprechen nicht den Mindestanforderungen von QUIQQER

# setup.web.system.check.desc
source: The following errors occurred. Please correct them and then click <em>Refresh button</em> or reload the page.
de: Folgende Fehler sind aufgetreten. Bitte beheben Sie diese und laden Sie die Seite neu.

# setup.web.system.check.button
source: Refresh
de: Neu laden

# setup.web.webInstall.more-button
source: Show details
de: Details anzeigen

# setup.web.webInstall.finishText
source: The installation is complete. You can now log in to the admin panel.
de: Die Installation ist abgeschlossen. Sie können sich jetzt im Admin-Panel einloggen.

# exception.validation.database.connection
source: Error on establishing data base connection
de: Fehler beim Aufbau der Datenbankverbindung

# exception.validation.user.empty
source: The user name field can not be empty.
de: Das Benutzernamefeld darf nicht leer sein

# exception.validation.passwords.empty
source: The password field can not be empty.
de: Das Passwordfeld darf nicht leer sein

# exception.validation.password.minlength
source: The password is to short.
de: Das eingegebene Passwort muss mindestens 8 Zeichen enthalten

# exception.validation.password.uppercasecount
source: The password does not contain any upper case.
de: Bitte verwenden Sie Groß- und Kleinbuchstaben.

# exception.validation.password.specialcount
source: The password does not contain a special character.
de: Das Passwort muss mindestens ein Sonderzeichen enthalten.

# exception.validation.password.numbercount
source: The password does not contain a number.
de: Bitte verwenden Sie mindestens eine Zahl in Ihrem Passwort.

# applypreset.done
source: The preset has been applied
de: Die Vorlage wurde angewendet.

# prompt.preset.customize
source: Do you want to customize the preset? (y/n)
de: Möchten Sie die Vorlage anpassen? (y/n)

# prompt.preset.customize.projectname
source: Projectname:
de: Projektname:

# prompt.preset.customize.languages
source: Languages (comma-separated):
de: Sprachen (komma-separiert):

# exception.preset.customization.data
source: The entered data is not valid!
de: Die angegeben Daten sind nicht gültig!

# exception.preset.customization.projectname.forbidden.characters
source: The projectname contains invalid characters.
de: Der Projektname enthält ungültige Zeichen.

# setup.preset.customization.projectname.fixed
source: QUIQQER has tried to fix the projectname:
de: QUIQQER hat versucht den Projektnamen zu reinigen:

# prompt.preset.customization.projectname.fixed.accept
source: Do you want tu use the fixed projectname instead? (y/n)
de: Möchten Sie den bereinigten Projektnamen verwenden? (y/n)

# applypreset.applying.preset
source: Applying preset:
de: Wende Vorlage an:

# applypreset.installed.languages
source: Successfully installed languages '%LANGS%' for project %PROJECT%
de: Sprachen '%LANGS%' erfolgreich für das Projekt %PROJECT% installiert

# message.webserver.detected.nginx
source: QUIQQER detected NGINX as webserver.
de: QUIQQER hat NGINX als Webserver erkannt.

# message.webserver.detected.apache22
source: QUIQQER detected Apache (2.2 or less) as webserver.
de: QUIQQER hat Apache in Version 2.2 oder niedriger als Webserver erkannt.

# message.webserver.detected.apache24
source: QUIQQER detected Apache (2.3 or higher) as webserver.
de: QUIQQER hat Apache in Version 2.3 oder höher als Webserver erkannt.
