Repository: QUIQQER/QSetup
Catalog: src/QUI/Setup/Locale/*/LC_MESSAGES/setupmessages.po
Languages: de

# setup.message.step.database
source: Preparing Database
de: Bereite Datenbank vor

# setup.message.step.start
source: Setup executing
de: Setup startet

# setup.database.creation.failed
source: Failed to create the database...
de: Fehler beim Erstellen der Datenbank

# setup.missing.database.xml
source: Could not find the database.xml file.
de: Konnte die Datei database.xml nicht finden.

# setup.message.step.user
source: Creating the admin user and group
de: Erstelle den Admin Benutzer und die Admin Gruppe

# setup.message.step.paths
source: Preparing filesystem paths
de: Bereite Dateisystempfade vor

# setup.filesystem.directory.creation.failed
source: Could not create the directory
de: Das Verzeichnis konnte nicht erstellt werden

# setup.message.step.composer
source: Starting composer. This will take a while. Please be patient.
de: Starte Composer. Dies könnte eine Weile dauern.

# setup.missing.composerjson
source: Could not find the composer.json file.
de: Konnte die composer.json Datei nicht finden

# setup.message.step.files
source: Creating the bootstrap files.
de: Erstelle die Bootstrap Dateien

# setup.message.step.setup
source: Running quiqqer setup routines
de: Starte die QUIQQER Setup Routinen

# setup.message.step.delete
source: Deleting setupfiles
de: Lösche die nicht mehr benötigten Dateien des Setups

# setup.message.step.checks
source: Running quiqqer health checks
de: Starte die QUIQQER checks

# setup.message.step.preset
source: Applying preset. This may take a while.
de: Setze Vorlage um. Dies kann etwas dauern.

# setup.filesystem.composerjson.notcreated
source: Could not create the composer.json file
de: Konnte die composer.json Datei nicht erstellen

# setup.filesystem.file.notwriteable
source: Could not write file
de: Die Datei konnte nicht geschrieben werden

# setup.language.set.success
source: Setup is now using the language :
de: Setup verwendet nun folgende Sprache:

# data.missing.lang
source: Missing data: language
de: Fehlende Daten: Sprache

# data.missing.version
source: Missing data : version
de: Fehlende Daten: Version

# data.missing.template
source: Missing Data : template
de: Fehlende Daten: Preset

# data.missing.database.driver
source: Missing Data : database driver
de: Fehlende Daten: Datenbank Treiber

# data.missing.database.host
source: Missing Data : database host
de: Fehlende Daten: Datenbank Host

# data.missing.database.user
source: Missing Data : database user name
de: Fehlende Daten: Datenbank Benutzer

# data.missing.database.pw
source: Missing Data : database user password
de: Fehlende Daten: Datenbank Password

# data.missing.database.db
source: Missing Data : database databasename
de: Fehlende Daten: Datenbankname

# data.missing.database.prefix
source: Missing Data : database prefix
de: Fehlende Daten: Datenbank Prefix

# data.missing.user.name
source: Missing Data : adminuser name
de: Fehlende Daten: Administrativer Benutzername

# data.missing.user.pw
source: Missing Data : adminuser password
de: Fehlende Daten: Administratives Passwort

# data.missing.paths.host
source: Missing Data : host
de: Fehlende Daten: Host

# data.missing.paths.cms_dir
source: Missing Data : path CMS_DIR
de: Fehlende Daten: Pfad CMS_DIR

# data.missing.paths.lib_dir
source: Missing Data : path LIB_DIR
de: Fehlende Daten: Pfad LIB_DIR

# data.missing.paths.usr_dir
source: Missing Data : path USR_DIR
de: Fehlende Daten: USR_DIR

# data.missing.paths.url_dir
source: Missing Data : path URL_DIR
de: Fehlende Daten: URL_DIR

# data.missing.paths.bin_dir
source: Missing Data : path BIN_DIR
de: BIN_DIR

# data.missing.paths.opt_dir
source: Missing Data : path OPT_DIR
de: Fehlende Daten: OPT_DIR

# data.missing.paths.var_dir
source: Missing Data : path VAR_DIR
de: Fehlende Daten: VAR_DIR

# database.no.database.selected
source: Can not start database operations because no database was selected
de: Es wurde versucht eine Datenbankoperation durchzuführen, obwohl keine Datenbank ausgewählt ist.

# setup.exception.validation.preset
source: The given preset is not valid
de: Das angegebene Preset ist nicht gültig.

# setup.unknown.error
source: Something went wrong during the setup process. Please check the logfiles
de: Während des Installationsvorganges ist etwas schief gegangen. Bitte überprüfen Sie die Logdateien.

# setup.setup.message.apply.preset
source: Applying preset to installation.
de: Wende Vorlage auf die Installation an.

# applypreset.adding.repository
source: Adding repository :
de: Füge ein Repository hinzu:

# applypreset.creating.project
source: Creating project :
de: Erstelle Projekt:

# applypreset.require.package
source: Installing package:
de: Installiere Paket:

# applypreset.set.config
source: Applying configuration :
de: Passe Konfiguration an.

# applypreset.set.layout
source: Set layout:
de: Verwende Layout

# applypreset.quiqqer.setup
source: Executing QUIQQER setup.
de: Führe QUIQQER Setup aus.

# message.step.language
source: Language settings
de: Spracheinstellung

# prompt.language
source: Please enter the main language for quiqqer:
de: Bitte wählen Sie die Standardsprache:

# message.step.requirements
source: System requirements
de: Systemvorraussetzungen

# message.step.version
source: Version selection
de: Versionswahl

# prompt.version
source: Please enter the version of Quieer that should be installed:
de: Bitte geben Sie die Version an, die installiert werden soll.

# message.preset.available
source: Following presets can be selected:
de: Folgende Vorlagen stehen zur Auswahl:

# message.step.template
source: Preset selection
de: Vorlagenauswahl

# prompt.template
source: Please enter the name of the preset you want to use:
de: Bitte geben Sie den Namen der Vorlage ein, die Sie verwenden möchten:

# message.step.database
source: Database settings
de: Datenbank Einstellungen

# prompt.database.driver
source: Database driver :
de: Datenbank Treiber:

# prompt.database.host
source: Database host :
de: Datenbank Host:

# prompt.database.port
source: Database port:
de: Datenbank Port:

# prompt.database.user
source: Database user:
de: Datenbank Benutzer:

# prompt.database.pw
source: Database password:
de: Datenbank Passwort:

# prompt.database.db
source: Database databasename :
de: Datenbank Name:

# prompt.database.createnew
source: The given database does not exist. Do you want QUIQQER to try and create it? (y/n)
de: Die angegebene Datenbank existiert nicht. Soll QUIQQER versuchen sie zu erstellen? (y/n)

# prompt.database.prefix
source: Database table prefix:
de: Datenbank Tabellen-prefix:

# message.step.superuser
source: Admin user
de: Adminbenutzer

# prompt.user
source: Username:
de: Benutzername:

# prompt.password
source: Password:
de: Passwort:

# message.step.paths
source: Pathsettings
de: Pfadeinstellungen

# prompt.host
source: URL :
de: Domain:

# prompt.cms
source: Installation directory:
de: QUIQQER Rootverzeichnis:

# prompt.url
source: Subdirectory after host
de: Url Verzeichnis:

# exception.validation.version.invalid
source: The given version is not valid.
de: Die von ihnen eingegeben Version ist nicht gültig.

# message.step.setup
source: Executing Setup
de: Ausführung

# setup.message.finished.header
source: Setup finished
de: Setup beendet

# setup.message.finished.text
source: Setup finished successfully. You can now open your website.
de: Setup erfolgreich beendet. Sie können ihre Webseite nun aufrufen.

# prompt.password.again
source: Please enter your password again:
de: Bitte geben Sie ihr Passwort erneut ein:

# setup.warning.dir.not.empty
source: The given directory is not empty!
de: Das angegebe Verzeichnis ist nicht leer! Möglicherweise werden Dateien überschrieben!

# setup.prompt.dir.not.empty
source: Do you want to continue anyway? (y/n)
de: Möchten Sie trotzdem fortfahren? (y/n)

# setup.prompt.continue.restored.data
source: Do you want to use the restored data? (y/n)
de: Möchten Sie die wiederhergestellten Daten verwenden? (y/n)

# setup.restored.data.lang
source: Language:
de: Sprache:

# setup.restored.data.preset
source: Preset:
de: Vorlage:

# setup.restored.data.database
source: Database settings:
de: Datenbank Angaben:

# setup.restored.data.database.driver
source: Driver:
de: Treiber:

# setup.restored.data.paths
source: Path settings:
de: Pfadangaben:

# setup.restored.data.paths.cms
source: CMS directory:
de: CMS Verzeichnis:

# setup.restored.data.paths.url
source: URL directory:
de: URL Verzeichnis:

# setup.restored.data.found
source: The setup has found restorable data :
de: Das Setup hat wiederherstellbare Daten gefunden:

# warning.database.not.empty
source: The given database is not empty!
de: Die angegebene Datenbank ist nicht leer!

# prompt.requirements.continue
source: Not all Systemrequirements are fulfilled. This can severly impact the functionality of QUIQQER. Do you want to continue anyways?
de: Nicht alle Systemvorraussetzungen sind erfüllt. Dies könnte zu maßgeblichen Einschränkungen der Funktionalität von QUIQQER führen. Möchten Sie trotzdem fortfahren?

# database.credentials.not.valid
source: The given database credentials are not valid
de: Die Datenbank Zugangsdaten sind nicht korrekt!

# setup.warning.password.missmatch
source: The passwords do not match!
de: Die Passwörter stimmen nicht überein. Bitte erneut versuchen

# messages.decorative.coffeetime
source: Almost done. Perfect time for a coffee.
de: Fast geschafft! Perfekte Zeit für einen Kaffee.

# locale.localeset.failed
source: The desired language could not be set.
de: Die gewünschte Sprache konnte nicht gesetzt werden.

# setup.filesystem.composerjson.not.writeable
source: The composer.json file could not be written
de: Die composer.json Datei konnte nicht beschrieben werden

# setup.filesystem.config.creation.failed
source: The configuration files could not be written.
de: Die Konfigurationsdateien konnten nicht beschrieben werden!

# exception.validation.password.empty
source: The password can not be empty.
de: Das Passwort darf nicht leer sein

# validation.database.driver.notfound
source: The given database driver could not be found.
de: Der angegebene Datenbank Treiber wurde nicht auf ihrem System gefunden.

# setup.validation.database.not.exists
source: The given database does not exist.
de: Die angegebene Datenbank existiert nicht

# setup.exception.validation.preset.not.exist
source: The given preset does not exist.
de: Die angegebene Vorlage konnte nicht gefunden werden.

# exception.validation.path.not.exist
source: The given path does not exist.
de: Der angegebene Pfad existiert nicht

# exception.validation.path.not.writeable
source: The given path is not empty.
de: Der angegebene Pfad konnte nicht beschrieben werden

# setup.warning.database.not.writeable
source: The given database could not be edited (Creating Tables)
de: Die angegebene Datenbank konnte nicht verändert werden. (Tabellen erstellen)

# setup.warning.database.not.createable
source: The given user could not create the database (No Permission)
de: Die angegebene Datenbank konnte nicht erstellt werden (Fehlende Rechte)

# warning.requirement.unknown
source: Some Requirements could not be detected. Please make sure that those Requirements are installed. This warning is void, if you know they are installed.
de: Nicht alle Systemvorraussetzungen konnten geprüft werden. Diese Warnung ist belanglos, falls Sie wissen, dass alle Vorraussetzungen erfüllt sind.

# prompt.database.not.empty.continue
source: How do you want to proceed? - n : Select new database - c : Clear the selected database. Warning all data will be lost! - q : Quit setup
de: Wie möchten Sie fortfahren? - n : Neue Datenbank wählen - c : Datenbank leeren. Warnung! Alle Daten gehen verloren! - q : Setup abbrechen

# help.prompt.host
source: The domain under which QUIQQER will be reachable. Should start with https:// and end with slash. Example : https://example.com
de: Die Domain unter welcher QUIQQER erreichbar sein wird. Die Domain sollte mit 'https://' beginnen und ohne Slash enden! Beispiel : https://example.com

# help.prompt.cms
source: The absolute path of the directory in which QUIQQER will be installed. Should end and start with slash. Example: /var/www/vhosts/example.com/httpdocs/
de: Der Absolute Pfad zu dem Verzeichnis, in welches QUIQQER auf dem Filesystem des Servers installiert wird. Muss mit Slash beginnen und enden! Beispiel : /var/www/vhosts/example.com/httpdocs/

# help.prompt.url
source: The path after the domain, if QUIQQER is installed into an subdirectory of the document root. Should start and end with slash. Example: /quiqqer/ for https://example.com/quiqqer/
de: Der Pfad nach der Domain, falls QUIQQER in ein Unterverzeichnis des Document Roots installiert wird. Muss mit Slash beginnen und enden. Beispiel : /quiqqer/ für https://example.com/quiqqer/

# setup.message.finished.filerights
source: Please make sure that the executing PHP-User owns the files and the Webserver has read-access.
de: Bitte stellen Sie sicher, dass der Webserver Leserechte auf die QUIQQER-Installation hat und der ausführende PHP-Benutzer der Besitzer der Dateien ist.

# setup.message.restoration.database.password.prompt
source: Please enter your database password again:
de: Bitte tippen Sie ihr Datenbank Passwort erneut ein.

# setup.message.restoration.user.password.prompt
source: Please enter your user password again:
de: Bitte tippen Sie ihr Benutzer Passwort erneut ein.

# setup.prompt.restoration.database.password
source: Database password:
de: Datenbank Passwort:

# setup.prompt.restoration.user.password
source: User password:
de: Benutzer Passwort:

# setup.prompt.restoration.database.password.repeat
source: Repeat database password:
de: Datenbank Passwort wiederholen:

# setup.prompt.restoration.user.password.repeat
source: Repeat user password:
de: Benutzer Passwort wiederholen:

# setup.message.restoration.database.password.invalid
source: The given password seems to be incorrect. Try again!
de: Das eingegebene Passwort scheint nicht korrekt zu sein. Bitte erneut versuchen.

# setup.error.mysql
source: MySql encountered an error:
de: MySql Fehler:

# setup.warning.execution.start
source: With this step all changes made on disk are nor revertable. This means you will have to clear the current directory and start voer again, if the setup should get cancelled.
de: Ab diesem Schritt sind alle Änderungen nicht mehr automatisch zurücksetzbar. Das heisst, Sie müssen, falls das Setup abbrechen sollte, den Inhalt dieses Verzeichnises löschen und von vorne beginnen.

# setup.prompt.execution.start
source: Are you sure you want to continue? (y/n)
de: Sind Sie sicher, dass Sie fortfahren wollen? (y/n)

# setup.workspaces.twocolumn.title
source: Two Columns
de: Zwei Spalten

# setup.workspaces.threecolumn.title
source: Three Columns
de: Drei Spalten

# prompt.database.hard.reset.warning
source: The Setup will DROP! all tables in the given database. Are you sure you want to continue? (y/n)
de: Das Setup wird alle Tabellen in der angegebenen Datenbank LÖSCHEN! Sind Sie sicher, dass Sie fortfahren wollen? (y/n)

# setup.message.finished.url
source: Adress of the website:
de: Adresse der Webseite:

# setup.message.finished.admin.url
source: Adresse of the admin area:
de: Adresse des Adminbereiches:

# prompt.cannot.be.empty
source: Can not be empty. Please try again.
de: Darf nicht leer sein. Bitte erneut versuchen.

# setup.web.noscript
source: The QUIQQER Setup only works in browser with JavaScript. Please activate JavaScript in your browser and refresh this page to continue.
de: Das QUIQQER Setup funktioniert nur mit JavaScript. Bitte schalten Sie JavaScript in Ihrem Browser ein und laden Sie die Seite neu.

# setup.web.header.siteLang
source: Language
de: Sprache

# setup.web.header.siteLang.text
source: Select the default language for your project. You can change the project language later in the project settings or add more languages.
de: Wählen Sie die Standardsprache für Ihr Projekt aus. Sie können die Projektsprache später in den Projekt-Einstellungen ändern oder weitere Sprachen hinzufügen.

# setup.web.header.version.text
source: The latest stable version is recommended for productive use. Developers can also choose between the dev-dev and dev-master versions. These versions are always up-to-date, but may be unstable.
de: Für den produktiven Einsatz wird die neueste stabile Version empfohlen. Entwickler oder expirimentierfreudige können auch zwischen den dev-dev und dev-master Versionen wählen. Diese Versionen sind zwar immer auf dem neuesten Stand, können jedoch unter Umständen instabil laufen.

# setup.web.header.template
source: Template
de: Vorlage

# setup.web.header.template.text
source: Select the type of your project from a template. You can change the project name and the project settings by clicking on the settings icon. <p class="smallFont ">The templates allow you to quickly and easily access pre-configured packages, e.g. a blog, a company presentation, a landing page or complete applications. You can also upload your own templates to the /templates/presets directory (for detailed instructions, see the QUIQQER FAQ).</p>
de: Wählen Sie den Typ Ihres Projektes aus einer Vorlage. Sie können den Projektnamen und die Projekteinstellungen ändern wenn Sie auf das Icon mit den Zahnrädern klicken. <p class="smallFont ">Mit den Vorlagen können Sie schnell und einfach auf vorkonfiguriete Pakte zugreifen und z.B. einen Blog, eine Firmenpresentation, eine Landingpage oder komplette Applikationen zur Installation auswählen. Sie können auch eigene Vorlagen in den Ordner /templates/presets hochladen (eine genaue Anleitung dazu finden Sie in den FAQ auf der QUIQQER-Webseite).</p>

# setup.web.header.dataBase
source: Database
de: Datenbank

# setup.web.header.dataBase.text
source: Enter all the data needed to connect to your database. Use "<i>table prefix"</i> if you want to use an existing database.
de: Geben Sie alle Daten ein, die benötigt werden um sich mit Ihrer Datenbank zu verbinden. Verwenden Sie <i>"Tabellen-Prefix"</i>, wenn Sie eine bereits existierende Datenbank verwenden wollen bzw. müssen.

# setup.web.header.user
source: Admin account
de: Administrativer Benutzer

# setup.web.header.user.text
source: The access data to log in to your backend panel. Keep your data in a safe place. <p class="smallFont "> The password must contain at least 8 characters one number. It also must contain uppercase and lowercase.</p>
de: Die Zugangsdaten, mit denen Sie sich im Backend-Panel als <i>Administrator</i> einloggen möchten. Bewahren Sie Ihre Zugangsdaten an einem sicheren Ort auf. <p class="smallFont "> Das Passwort muss mindestens aus 8 Zeichen bestehen, es muss Groß- und Kleinbuchstaben sowie mindestens eine Zahl enthalten.</p>

# setup.web.header.hostAndDirectory
source: Host and directories
de: Host und Pfade

# setup.web.header.hostAndDirectory.text
source: Here you can customize the main domain and the paths of your installation. The required data were determined automatically. You only need to make changes if you are sure that the data are not correct. <p class="smallFont"> For more information, click the <i>Info Icon</i> </p>
de: Sie können hier die Hauptdomain und die Pfade Ihrer Installation anpassen. Die benötigte Daten wurden automatisch ermittelt. Sie brauchen nur Änderungen vornehmen, wenn Sie sich sicher sind, dass die Daten nicht korrekt sind. <p class="smallFont ">Mehr Informationen erfahren Sie, wenn Sie auf die <i>Info-Icon</i> klicken.</p>

# setup.web.header.license
source: License
de: Lizenz

# setup.web.header.license.text
source: Please read the following license agreement carefully and accept it to proceed with the QUIQQER installation.
de: Bitte lesen Sie folgende Lizenzvereinbarung sorgfältig durch und akzeptieren Sie diese, um mit der QUIQQER Installation fortzufahren.

# setup.web.nav.siteLang
source: Language
de: Sprache

# setup.web.nav.template
source: Template
de: Vorlage

# setup.web.nav.dataBase
source: Database
de: Datenbank

# setup.web.nav.user
source: Admin account
de: Login / Benutzer

# setup.web.nav.hostAndDirectory
source: Host and directories
de: Host und Pfade

# setup.web.nav.license
source: License
de: Lizenz

# setup.web.content.lang.de
source: German
de: Deutsch

# setup.web.content.lang.en
source: English
de: Englisch

# setup.web.content.dbDriver
source: Database driver
de: Datenbank Treiber

# setup.web.content.dbHost
source: Database host
de: Datenbank Host

# setup.web.content.dbPort
source: Database port
de: Datenbank Port

# setup.web.content.dbName
source: Database name
de: Datenbank Name

# setup.web.content.dbPrefix
source: Database prefix
de: Tabellen-Prefix (optional)

# setup.web.content.dbUser
source: Database user
de: Datenbank Benutzer

# setup.web.content.dbPassword
source: Database password
de: Datenbank Passwort

# setup.web.content.rootUser
source: User
de: Benutzer

# setup.web.content.rootPassword
source: Password
de: Passwort

# setup.web.content.rootPasswordRepeat
source: Repeat password
de: Passwort wiederholen

# setup.web.content.password.show
source: Show password
de: Passwort anzeigen

# setup.web.content.password.hide
source: Hide password
de: Password verbergen

# setup.web.content.domain
source: Domain
de: Domäne

# setup.web.content.rootDirectory
source: Root directory
de: Rootverzeichnis

# setup.web.content.urlDirectory
source: URL directory
de: URL Unterverzeichnis

# setup.web.content.domain.help
source: Domain - help
de: Domäne - Hilfe

# setup.web.content.rootDirectory.help
source: Root directory - help
de: Rootverzeichnis - Hilfe

# setup.web.content.urlSubPath.help
source: URL path - help
de: URL Unterverzeichnis - Hilfe

# setup.web.content.hostError
source: All fields are required.
de: Alle Felder müssen ausgefüllt sein.

# setup.web.content.autoFill
source: Detect automatically
de: Automatisch ermitteln

# setup.web.error.fill.all.fields
source: Please fill all fields.
de: Bitte alle Felder ausfüllen.

# setup.web.content.license.text
source: <h1>QUIQQER license agreement</h1><p>All license information on QUIQQER can be found in the installation files or at <a href="https://www.quiqqer.com/License=" target="_blank">https://www.quiqqer.com/Lizenz</a></p><p> Please read the license agreement carefully and agree to install it.</p><p class="smallFont">By installing extensions or templates, license agreements can be added by third parties. Please inform yourself about possible licensing conditions and limitations due to extensions before the installation.</p>
de: <h1>QUIQQER - Lizenzvereinbahrung</h1><p> Alle Linzenzinformationen zu QUIQQER finden Sie bei den Installationsdateien oder unter <a href="https://store.quiqqer.de/Lizenz" target="_blank">https://store.quiqqer.de/Lizenz</a></p><p>Bitte lesen Sie die Lizenzvereinbarungen Sorgfältig durch und stimmen Sie diesen zu um QUIQQER zu instalieren</p><p class="smallFont"> Durch die installation von Erweiterungen, Templates oder Vorlagen können Lizenzvereinbahrungen von Drittanbietern hinzukommen, bitte Informieren Sie sich vor der Installation über mögliche Lizenzbedingungen und Einschränkungen durch Erweiterungen.</p>

# setup.web.content.license.checkbox
source: Yes, I have read the license terms and agree to them
de: Ja, ich habe die Lizenzinformationen gelesen und bin damit einverstanden

# setup.web.content.button.next
source: next
de: Fortfahren

# setup.web.content.button.back
source: back
de: Zurück

# setup.web.content.button.install
source: install
de: Installieren

# setup.web.popup.project-title
source: Project name
de: Projektname

# setup.web.popup.project-language
source: Project language
de: Projektsprache

# setup.web.popup.cancel-button
source: Cancel
de: Abbrechen

# setup.web.popup.save-button
source: Save
de: Speichern
